def area(a, b): 
    """
    Вычисляет площадь прямоугольника.

    Параметры:
        a (float): длина одной стороны
        b (float): длина стороны, смежной a
    
    Возвращаемое значение:
        float: площадь прямоугольника
    """
    return a * b 


def perimeter(a, b): 
    """
    Вычисляет периметр прямоугольника.

    Параметры:
        a (float): длина одной стороны
        b (float): длина стороны, смежной a
    
    Возвращаемое значение:
        float: периметр прямоугольника
    """
    return (a + b) * 2
